/* automatically generated by rust-bindgen */

pub const configUSE_PREEMPTION: u32 = 1;
pub const configUSE_PORT_OPTIMISED_TASK_SELECTION: u32 = 0;
pub const configUSE_TICKLESS_IDLE: u32 = 0;
pub const configTICK_RATE_HZ: u32 = 100;
pub const configMAX_PRIORITIES: u32 = 5;
pub const configMINIMAL_STACK_SIZE: u32 = 128;
pub const configMAX_TASK_NAME_LEN: u32 = 16;
pub const configUSE_16_BIT_TICKS: u32 = 0;
pub const configIDLE_SHOULD_YIELD: u32 = 1;
pub const configUSE_TASK_NOTIFICATIONS: u32 = 1;
pub const configUSE_MUTEXES: u32 = 0;
pub const configUSE_RECURSIVE_MUTEXES: u32 = 0;
pub const configUSE_COUNTING_SEMAPHORES: u32 = 0;
pub const configUSE_ALTERNATIVE_API: u32 = 0;
pub const configQUEUE_REGISTRY_SIZE: u32 = 10;
pub const configUSE_QUEUE_SETS: u32 = 0;
pub const configUSE_TIME_SLICING: u32 = 0;
pub const configUSE_NEWLIB_REENTRANT: u32 = 0;
pub const configENABLE_BACKWARD_COMPATIBILITY: u32 = 0;
pub const configNUM_THREAD_LOCAL_STORAGE_POINTERS: u32 = 5;
pub const configSUPPORT_STATIC_ALLOCATION: u32 = 1;
pub const configSUPPORT_DYNAMIC_ALLOCATION: u32 = 1;
pub const configTOTAL_HEAP_SIZE: u32 = 10240;
pub const configAPPLICATION_ALLOCATED_HEAP: u32 = 1;
pub const configUSE_IDLE_HOOK: u32 = 0;
pub const configUSE_TICK_HOOK: u32 = 1;
pub const configCHECK_FOR_STACK_OVERFLOW: u32 = 0;
pub const configUSE_MALLOC_FAILED_HOOK: u32 = 1;
pub const configUSE_DAEMON_TASK_STARTUP_HOOK: u32 = 0;
pub const configGENERATE_RUN_TIME_STATS: u32 = 0;

pub const pdFREERTOS_ERRNO_EROFS: u32 = 30;
pub const pdFREERTOS_ERRNO_EUNATCH: u32 = 42;
pub const pdFREERTOS_ERRNO_EBADE: u32 = 50;
pub const pdFREERTOS_ERRNO_EFTYPE: u32 = 79;
pub const pdFREERTOS_ERRNO_ENMFILE: u32 = 89;
pub const pdFREERTOS_ERRNO_ENOTEMPTY: u32 = 90;
pub const pdFREERTOS_ERRNO_ENAMETOOLONG: u32 = 91;
pub const pdFREERTOS_ERRNO_EOPNOTSUPP: u32 = 95;
pub const pdFREERTOS_ERRNO_ENOBUFS: u32 = 105;
pub const pdFREERTOS_ERRNO_ENOPROTOOPT: u32 = 109;
pub const pdFREERTOS_ERRNO_EADDRINUSE: u32 = 112;
pub const pdFREERTOS_ERRNO_ETIMEDOUT: u32 = 116;
pub const pdFREERTOS_ERRNO_EINPROGRESS: u32 = 119;
pub const pdFREERTOS_ERRNO_EALREADY: u32 = 120;
pub const pdFREERTOS_ERRNO_EADDRNOTAVAIL: u32 = 125;
pub const pdFREERTOS_ERRNO_EISCONN: u32 = 127;
pub const pdFREERTOS_ERRNO_ENOTCONN: u32 = 128;
pub const pdFREERTOS_ERRNO_ENOMEDIUM: u32 = 135;
pub const pdFREERTOS_ERRNO_EILSEQ: u32 = 138;
pub const pdFREERTOS_ERRNO_ECANCELED: u32 = 140;
pub const pdFREERTOS_LITTLE_ENDIAN: u32 = 0;
pub const pdFREERTOS_BIG_ENDIAN: u32 = 1;
pub const pdLITTLE_ENDIAN: u32 = 0;
pub const pdBIG_ENDIAN: u32 = 1;
pub const portTICK_TYPE_IS_ATOMIC: u32 = 1;
pub const portSTACK_GROWTH: i32 = -1;
pub const portBYTE_ALIGNMENT: u32 = 8;
pub const portNVIC_PENDSVSET_BIT: u32 = 268435456;
pub const portBYTE_ALIGNMENT_MASK: u32 = 7;
pub const portNUM_CONFIGURABLE_REGIONS: u32 = 1;
pub const portHAS_STACK_OVERFLOW_CHECKING: u32 = 0;
pub const portUSING_MPU_WRAPPERS: u32 = 0;
pub const INCLUDE_xQueueGetMutexHolder: u32 = 0;
pub const INCLUDE_xSemaphoreGetMutexHolder: u32 = 0;
pub const INCLUDE_uxTaskGetStackHighWaterMark2: u32 = 0;
pub const configUSE_APPLICATION_TASK_TAG: u32 = 0;
pub const portCRITICAL_NESTING_IN_TCB: u32 = 0;
pub const configASSERT_DEFINED: u32 = 1;
pub const configRECORD_STACK_HIGH_ADDRESS: u32 = 0;
pub const configINCLUDE_FREERTOS_TASK_C_ADDITIONS_H: u32 = 0;
pub const configEXPECTED_IDLE_TIME_BEFORE_SLEEP: u32 = 2;
pub const configUSE_POSIX_ERRNO: u32 = 0;
pub const configINITIAL_TICK_COUNT: u32 = 0;
pub const configUSE_TASK_FPU_SUPPORT: u32 = 1;
pub const configENABLE_MPU: u32 = 0;
pub const configENABLE_FPU: u32 = 1;
pub const configENABLE_TRUSTZONE: u32 = 1;
pub const configRUN_FREERTOS_SECURE_ONLY: u32 = 0;
pub const tskKERNEL_VERSION_NUMBER: &'static [u8; 8usize] = b"V10.2.0\0";
pub const tskKERNEL_VERSION_MAJOR: u32 = 10;
pub const tskKERNEL_VERSION_MINOR: u32 = 2;
pub const tskKERNEL_VERSION_BUILD: u32 = 0;
pub const tskMPU_REGION_READ_ONLY: u32 = 1;
pub const tskMPU_REGION_READ_WRITE: u32 = 2;
pub const tskMPU_REGION_EXECUTE_NEVER: u32 = 4;
pub const tskMPU_REGION_NORMAL_MEMORY: u32 = 8;
pub const tskMPU_REGION_DEVICE_MEMORY: u32 = 16;
pub type wchar_t = c_types::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: c_types::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = c_types::c_longlong;
pub type uintmax_t = c_types::c_ulonglong;
extern "C" {
    pub static mut SystemCoreClock: u32;
}
pub type TaskFunction_t = ::core::option::Option<unsafe extern "C" fn(arg1: *mut c_types::c_void)>;
pub type StackType_t = u32;
pub type BaseType_t = c_types::c_long;
pub type UBaseType_t = c_types::c_ulong;
pub type TickType_t = u32;
extern "C" {
    pub fn vPortYield();
}
extern "C" {
    pub fn vPortEnterCritical();
}
extern "C" {
    pub fn vPortExitCritical();
}
extern "C" {
    pub fn ulSetInterruptMaskFromISR() -> u32;
}
extern "C" {
    pub fn vClearInterruptMaskFromISR(ulMask: u32);
}
extern "C" {
    pub fn pxPortInitialiseStack(
        pxTopOfStack: *mut StackType_t,
        pxCode: TaskFunction_t,
        pvParameters: *mut c_types::c_void,
    ) -> *mut StackType_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HeapRegion {
    pub pucStartAddress: *mut u8,
    pub xSizeInBytes: usize,
}
#[test]
fn bindgen_test_layout_HeapRegion() {
    assert_eq!(
        ::core::mem::size_of::<HeapRegion>(),
        8usize,
        concat!("Size of: ", stringify!(HeapRegion))
    );
    assert_eq!(
        ::core::mem::align_of::<HeapRegion>(),
        4usize,
        concat!("Alignment of ", stringify!(HeapRegion))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<HeapRegion>())).pucStartAddress as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HeapRegion),
            "::",
            stringify!(pucStartAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<HeapRegion>())).xSizeInBytes as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HeapRegion),
            "::",
            stringify!(xSizeInBytes)
        )
    );
}
pub type HeapRegion_t = HeapRegion;
extern "C" {
    pub fn vPortDefineHeapRegions(pxHeapRegions: *const HeapRegion_t);
}
extern "C" {
    pub fn pvPortMalloc(xSize: usize) -> *mut c_types::c_void;
}
extern "C" {
    pub fn vPortFree(pv: *mut c_types::c_void);
}
extern "C" {
    pub fn vPortInitialiseBlocks();
}
extern "C" {
    pub fn xPortGetFreeHeapSize() -> usize;
}
extern "C" {
    pub fn xPortGetMinimumEverFreeHeapSize() -> usize;
}
extern "C" {
    pub fn xPortStartScheduler() -> BaseType_t;
}
extern "C" {
    pub fn vPortEndScheduler();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_LIST_ITEM {
    pub xDummy2: TickType_t,
    pub pvDummy3: [*mut c_types::c_void; 4usize],
}
#[test]
fn bindgen_test_layout_xSTATIC_LIST_ITEM() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_LIST_ITEM>(),
        20usize,
        concat!("Size of: ", stringify!(xSTATIC_LIST_ITEM))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_LIST_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_LIST_ITEM))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST_ITEM>())).xDummy2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST_ITEM),
            "::",
            stringify!(xDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST_ITEM>())).pvDummy3 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST_ITEM),
            "::",
            stringify!(pvDummy3)
        )
    );
}
pub type StaticListItem_t = xSTATIC_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_MINI_LIST_ITEM {
    pub xDummy2: TickType_t,
    pub pvDummy3: [*mut c_types::c_void; 2usize],
}
#[test]
fn bindgen_test_layout_xSTATIC_MINI_LIST_ITEM() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_MINI_LIST_ITEM>(),
        12usize,
        concat!("Size of: ", stringify!(xSTATIC_MINI_LIST_ITEM))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_MINI_LIST_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_MINI_LIST_ITEM))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_MINI_LIST_ITEM>())).xDummy2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_MINI_LIST_ITEM),
            "::",
            stringify!(xDummy2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xSTATIC_MINI_LIST_ITEM>())).pvDummy3 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_MINI_LIST_ITEM),
            "::",
            stringify!(pvDummy3)
        )
    );
}
pub type StaticMiniListItem_t = xSTATIC_MINI_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_LIST {
    pub uxDummy2: UBaseType_t,
    pub pvDummy3: *mut c_types::c_void,
    pub xDummy4: StaticMiniListItem_t,
}
#[test]
fn bindgen_test_layout_xSTATIC_LIST() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_LIST>(),
        20usize,
        concat!("Size of: ", stringify!(xSTATIC_LIST))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_LIST>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_LIST))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST>())).uxDummy2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST),
            "::",
            stringify!(uxDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST>())).pvDummy3 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST),
            "::",
            stringify!(pvDummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_LIST>())).xDummy4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_LIST),
            "::",
            stringify!(xDummy4)
        )
    );
}
pub type StaticList_t = xSTATIC_LIST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_TCB {
    pub pxDummy1: *mut c_types::c_void,
    pub xDummy3: [StaticListItem_t; 2usize],
    pub uxDummy5: UBaseType_t,
    pub pxDummy6: *mut c_types::c_void,
    pub ucDummy7: [u8; 16usize],
    pub pvDummy15: [*mut c_types::c_void; 5usize],
    pub ulDummy18: u32,
    pub ucDummy19: u8,
    pub uxDummy20: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_TCB() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_TCB>(),
        96usize,
        concat!("Size of: ", stringify!(xSTATIC_TCB))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_TCB>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_TCB))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).pxDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(pxDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).xDummy3 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(xDummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).uxDummy5 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(uxDummy5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).pxDummy6 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(pxDummy6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).ucDummy7 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(ucDummy7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).pvDummy15 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(pvDummy15)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).ulDummy18 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(ulDummy18)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).ucDummy19 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(ucDummy19)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TCB>())).uxDummy20 as *const _ as usize },
        93usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TCB),
            "::",
            stringify!(uxDummy20)
        )
    );
}
pub type StaticTask_t = xSTATIC_TCB;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xSTATIC_QUEUE {
    pub pvDummy1: [*mut c_types::c_void; 3usize],
    pub u: xSTATIC_QUEUE__bindgen_ty_1,
    pub xDummy3: [StaticList_t; 2usize],
    pub uxDummy4: [UBaseType_t; 3usize],
    pub ucDummy5: [u8; 2usize],
    pub ucDummy6: u8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union xSTATIC_QUEUE__bindgen_ty_1 {
    pub pvDummy2: *mut c_types::c_void,
    pub uxDummy2: UBaseType_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_xSTATIC_QUEUE__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_QUEUE__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(xSTATIC_QUEUE__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_QUEUE__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_QUEUE__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xSTATIC_QUEUE__bindgen_ty_1>())).pvDummy2 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE__bindgen_ty_1),
            "::",
            stringify!(pvDummy2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xSTATIC_QUEUE__bindgen_ty_1>())).uxDummy2 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE__bindgen_ty_1),
            "::",
            stringify!(uxDummy2)
        )
    );
}
#[test]
fn bindgen_test_layout_xSTATIC_QUEUE() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_QUEUE>(),
        72usize,
        concat!("Size of: ", stringify!(xSTATIC_QUEUE))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_QUEUE>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_QUEUE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).pvDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(pvDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).u as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).xDummy3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(xDummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).uxDummy4 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(uxDummy4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).ucDummy5 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(ucDummy5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_QUEUE>())).ucDummy6 as *const _ as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_QUEUE),
            "::",
            stringify!(ucDummy6)
        )
    );
}
pub type StaticQueue_t = xSTATIC_QUEUE;
pub type StaticSemaphore_t = StaticQueue_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_EVENT_GROUP {
    pub xDummy1: TickType_t,
    pub xDummy2: StaticList_t,
    pub ucDummy4: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_EVENT_GROUP() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_EVENT_GROUP>(),
        28usize,
        concat!("Size of: ", stringify!(xSTATIC_EVENT_GROUP))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_EVENT_GROUP>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_EVENT_GROUP))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_EVENT_GROUP>())).xDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_EVENT_GROUP),
            "::",
            stringify!(xDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_EVENT_GROUP>())).xDummy2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_EVENT_GROUP),
            "::",
            stringify!(xDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_EVENT_GROUP>())).ucDummy4 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_EVENT_GROUP),
            "::",
            stringify!(ucDummy4)
        )
    );
}
pub type StaticEventGroup_t = xSTATIC_EVENT_GROUP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_TIMER {
    pub pvDummy1: *mut c_types::c_void,
    pub xDummy2: StaticListItem_t,
    pub xDummy3: TickType_t,
    pub pvDummy5: *mut c_types::c_void,
    pub pvDummy6: TaskFunction_t,
    pub ucDummy8: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_TIMER() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_TIMER>(),
        40usize,
        concat!("Size of: ", stringify!(xSTATIC_TIMER))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_TIMER>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_TIMER))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).pvDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(pvDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).xDummy2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(xDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).xDummy3 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(xDummy3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).pvDummy5 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(pvDummy5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).pvDummy6 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(pvDummy6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_TIMER>())).ucDummy8 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_TIMER),
            "::",
            stringify!(ucDummy8)
        )
    );
}
pub type StaticTimer_t = xSTATIC_TIMER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xSTATIC_STREAM_BUFFER {
    pub uxDummy1: [usize; 4usize],
    pub pvDummy2: [*mut c_types::c_void; 3usize],
    pub ucDummy3: u8,
}
#[test]
fn bindgen_test_layout_xSTATIC_STREAM_BUFFER() {
    assert_eq!(
        ::core::mem::size_of::<xSTATIC_STREAM_BUFFER>(),
        32usize,
        concat!("Size of: ", stringify!(xSTATIC_STREAM_BUFFER))
    );
    assert_eq!(
        ::core::mem::align_of::<xSTATIC_STREAM_BUFFER>(),
        4usize,
        concat!("Alignment of ", stringify!(xSTATIC_STREAM_BUFFER))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_STREAM_BUFFER>())).uxDummy1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_STREAM_BUFFER),
            "::",
            stringify!(uxDummy1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_STREAM_BUFFER>())).pvDummy2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_STREAM_BUFFER),
            "::",
            stringify!(pvDummy2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xSTATIC_STREAM_BUFFER>())).ucDummy3 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(xSTATIC_STREAM_BUFFER),
            "::",
            stringify!(ucDummy3)
        )
    );
}
pub type StaticStreamBuffer_t = xSTATIC_STREAM_BUFFER;
pub type StaticMessageBuffer_t = StaticStreamBuffer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xLIST_ITEM {
    pub xItemValue: TickType_t,
    pub pxNext: *mut xLIST_ITEM,
    pub pxPrevious: *mut xLIST_ITEM,
    pub pvOwner: *mut c_types::c_void,
    pub pxContainer: *mut xLIST,
}
#[test]
fn bindgen_test_layout_xLIST_ITEM() {
    assert_eq!(
        ::core::mem::size_of::<xLIST_ITEM>(),
        20usize,
        concat!("Size of: ", stringify!(xLIST_ITEM))
    );
    assert_eq!(
        ::core::mem::align_of::<xLIST_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(xLIST_ITEM))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).xItemValue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(xItemValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).pxNext as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(pxNext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).pxPrevious as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(pxPrevious)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).pvOwner as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(pvOwner)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST_ITEM>())).pxContainer as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST_ITEM),
            "::",
            stringify!(pxContainer)
        )
    );
}
pub type ListItem_t = xLIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMINI_LIST_ITEM {
    pub xItemValue: TickType_t,
    pub pxNext: *mut xLIST_ITEM,
    pub pxPrevious: *mut xLIST_ITEM,
}
#[test]
fn bindgen_test_layout_xMINI_LIST_ITEM() {
    assert_eq!(
        ::core::mem::size_of::<xMINI_LIST_ITEM>(),
        12usize,
        concat!("Size of: ", stringify!(xMINI_LIST_ITEM))
    );
    assert_eq!(
        ::core::mem::align_of::<xMINI_LIST_ITEM>(),
        4usize,
        concat!("Alignment of ", stringify!(xMINI_LIST_ITEM))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMINI_LIST_ITEM>())).xItemValue as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xMINI_LIST_ITEM),
            "::",
            stringify!(xItemValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMINI_LIST_ITEM>())).pxNext as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xMINI_LIST_ITEM),
            "::",
            stringify!(pxNext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMINI_LIST_ITEM>())).pxPrevious as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xMINI_LIST_ITEM),
            "::",
            stringify!(pxPrevious)
        )
    );
}
pub type MiniListItem_t = xMINI_LIST_ITEM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xLIST {
    pub uxNumberOfItems: UBaseType_t,
    pub pxIndex: *mut ListItem_t,
    pub xListEnd: MiniListItem_t,
}
#[test]
fn bindgen_test_layout_xLIST() {
    assert_eq!(
        ::core::mem::size_of::<xLIST>(),
        20usize,
        concat!("Size of: ", stringify!(xLIST))
    );
    assert_eq!(
        ::core::mem::align_of::<xLIST>(),
        4usize,
        concat!("Alignment of ", stringify!(xLIST))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST>())).uxNumberOfItems as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST),
            "::",
            stringify!(uxNumberOfItems)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST>())).pxIndex as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST),
            "::",
            stringify!(pxIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xLIST>())).xListEnd as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xLIST),
            "::",
            stringify!(xListEnd)
        )
    );
}
pub type List_t = xLIST;
extern "C" {
    pub fn vListInitialise(pxList: *mut List_t);
}
extern "C" {
    pub fn vListInitialiseItem(pxItem: *mut ListItem_t);
}
extern "C" {
    pub fn vListInsert(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
extern "C" {
    pub fn vListInsertEnd(pxList: *mut List_t, pxNewListItem: *mut ListItem_t);
}
extern "C" {
    pub fn uxListRemove(pxItemToRemove: *mut ListItem_t) -> UBaseType_t;
}
pub type CoRoutineHandle_t = *mut c_types::c_void;
pub type crCOROUTINE_CODE =
    ::core::option::Option<unsafe extern "C" fn(arg1: CoRoutineHandle_t, arg2: UBaseType_t)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct corCoRoutineControlBlock {
    pub pxCoRoutineFunction: crCOROUTINE_CODE,
    pub xGenericListItem: ListItem_t,
    pub xEventListItem: ListItem_t,
    pub uxPriority: UBaseType_t,
    pub uxIndex: UBaseType_t,
    pub uxState: u16,
}
#[test]
fn bindgen_test_layout_corCoRoutineControlBlock() {
    assert_eq!(
        ::core::mem::size_of::<corCoRoutineControlBlock>(),
        56usize,
        concat!("Size of: ", stringify!(corCoRoutineControlBlock))
    );
    assert_eq!(
        ::core::mem::align_of::<corCoRoutineControlBlock>(),
        4usize,
        concat!("Alignment of ", stringify!(corCoRoutineControlBlock))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<corCoRoutineControlBlock>())).pxCoRoutineFunction as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(corCoRoutineControlBlock),
            "::",
            stringify!(pxCoRoutineFunction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<corCoRoutineControlBlock>())).xGenericListItem as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(corCoRoutineControlBlock),
            "::",
            stringify!(xGenericListItem)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<corCoRoutineControlBlock>())).xEventListItem as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(corCoRoutineControlBlock),
            "::",
            stringify!(xEventListItem)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<corCoRoutineControlBlock>())).uxPriority as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(corCoRoutineControlBlock),
            "::",
            stringify!(uxPriority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<corCoRoutineControlBlock>())).uxIndex as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(corCoRoutineControlBlock),
            "::",
            stringify!(uxIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<corCoRoutineControlBlock>())).uxState as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(corCoRoutineControlBlock),
            "::",
            stringify!(uxState)
        )
    );
}
pub type CRCB_t = corCoRoutineControlBlock;
extern "C" {
    #[doc = " croutine. h"]
    #[doc = "<pre>"]
    #[doc = "BaseType_t xCoRoutineCreate("]
    #[doc = "crCOROUTINE_CODE pxCoRoutineCode,"]
    #[doc = "UBaseType_t uxPriority,"]
    #[doc = "UBaseType_t uxIndex"]
    #[doc = ");</pre>"]
    #[doc = ""]
    #[doc = " Create a new co-routine and add it to the list of co-routines that are"]
    #[doc = " ready to run."]
    #[doc = ""]
    #[doc = " @param pxCoRoutineCode Pointer to the co-routine function.  Co-routine"]
    #[doc = " functions require special syntax - see the co-routine section of the WEB"]
    #[doc = " documentation for more information."]
    #[doc = ""]
    #[doc = " @param uxPriority The priority with respect to other co-routines at which"]
    #[doc = "  the co-routine will run."]
    #[doc = ""]
    #[doc = " @param uxIndex Used to distinguish between different co-routines that"]
    #[doc = " execute the same function.  See the example below and the co-routine section"]
    #[doc = " of the WEB documentation for further information."]
    #[doc = ""]
    #[doc = " @return pdPASS if the co-routine was successfully created and added to a ready"]
    #[doc = " list, otherwise an error code defined with ProjDefs.h."]
    #[doc = ""]
    #[doc = " Example usage:"]
    #[doc = "<pre>"]
    #[doc = "void vFlashCoRoutine( CoRoutineHandle_t xHandle, UBaseType_t uxIndex )"]
    #[doc = "{"]
    #[doc = "static const char cLedToFlash[ 2 ] = { 5, 6 };"]
    #[doc = "static const TickType_t uxFlashRates[ 2 ] = { 200, 400 };"]
    #[doc = ""]
    #[doc = "crSTART( xHandle );"]
    #[doc = ""]
    #[doc = "for( ;; )"]
    #[doc = "{"]
    #[doc = "vParTestToggleLED( cLedToFlash[ uxIndex ] );"]
    #[doc = "crDELAY( xHandle, uxFlashRates[ uxIndex ] );"]
    #[doc = "}"]
    #[doc = ""]
    #[doc = "crEND();"]
    #[doc = "}"]
    #[doc = ""]
    #[doc = "void vOtherFunction( void )"]
    #[doc = "{"]
    #[doc = "uint8_t ucParameterToPass;"]
    #[doc = "TaskHandle_t xHandle;"]
    #[doc = ""]
    #[doc = "for( uxIndex = 0; uxIndex < 2; uxIndex++ )"]
    #[doc = "{"]
    #[doc = "xCoRoutineCreate( vFlashCoRoutine, 0, uxIndex );"]
    #[doc = "}"]
    #[doc = "}"]
    #[doc = "</pre>"]
    #[doc = " \\defgroup xCoRoutineCreate xCoRoutineCreate"]
    #[doc = " \\ingroup Tasks"]
    pub fn xCoRoutineCreate(
        pxCoRoutineCode: crCOROUTINE_CODE,
        uxPriority: UBaseType_t,
        uxIndex: UBaseType_t,
    ) -> BaseType_t;
}
extern "C" {
    #[doc = " croutine. h"]
    #[doc = "<pre>"]
    #[doc = "void vCoRoutineSchedule( void );</pre>"]
    #[doc = ""]
    #[doc = " Run a co-routine."]
    #[doc = ""]
    #[doc = " vCoRoutineSchedule() executes the highest priority co-routine that is able"]
    #[doc = " to run.  The co-routine will execute until it either blocks, yields or is"]
    #[doc = " preempted by a task.  Co-routines execute cooperatively so one"]
    #[doc = " co-routine cannot be preempted by another, but can be preempted by a task."]
    #[doc = ""]
    #[doc = " If an application comprises of both tasks and co-routines then"]
    #[doc = " vCoRoutineSchedule should be called from the idle task (in an idle task"]
    #[doc = " hook)."]
    #[doc = ""]
    #[doc = " Example usage:"]
    #[doc = "<pre>"]
    #[doc = "void vApplicationIdleHook( void )"]
    #[doc = "{"]
    #[doc = "vCoRoutineSchedule();"]
    #[doc = "}"]
    #[doc = ""]
    #[doc = "void vApplicationIdleHook( void )"]
    #[doc = "{"]
    #[doc = "for( ;; )"]
    #[doc = "{"]
    #[doc = "vCoRoutineSchedule();"]
    #[doc = "}"]
    #[doc = "}"]
    #[doc = "</pre>"]
    #[doc = " \\defgroup vCoRoutineSchedule vCoRoutineSchedule"]
    #[doc = " \\ingroup Tasks"]
    pub fn vCoRoutineSchedule();
}
extern "C" {
    pub fn vCoRoutineAddToDelayedList(xTicksToDelay: TickType_t, pxEventList: *mut List_t);
}
extern "C" {
    pub fn xCoRoutineRemoveFromEventList(pxEventList: *const List_t) -> BaseType_t;
}
#[doc = " task. h"]
#[doc = ""]
#[doc = " Type by which tasks are referenced.  For example, a call to xTaskCreate"]
#[doc = " returns (via a pointer parameter) an TaskHandle_t variable that can then"]
#[doc = " be used as a parameter to vTaskDelete to delete the task."]
#[doc = ""]
#[doc = " \\defgroup TaskHandle_t TaskHandle_t"]
#[doc = " \\ingroup Tasks"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tskTaskControlBlock {
    _unused: [u8; 0],
}
pub type TaskHandle_t = *mut tskTaskControlBlock;
pub type TaskHookFunction_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut c_types::c_void) -> BaseType_t>;
pub const eTaskState_eRunning: eTaskState = 0;
pub const eTaskState_eReady: eTaskState = 1;
pub const eTaskState_eBlocked: eTaskState = 2;
pub const eTaskState_eSuspended: eTaskState = 3;
pub const eTaskState_eDeleted: eTaskState = 4;
pub const eTaskState_eInvalid: eTaskState = 5;
pub type eTaskState = u32;
pub const eNotifyAction_eNoAction: eNotifyAction = 0;
pub const eNotifyAction_eSetBits: eNotifyAction = 1;
pub const eNotifyAction_eIncrement: eNotifyAction = 2;
pub const eNotifyAction_eSetValueWithOverwrite: eNotifyAction = 3;
pub const eNotifyAction_eSetValueWithoutOverwrite: eNotifyAction = 4;
pub type eNotifyAction = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTIME_OUT {
    pub xOverflowCount: BaseType_t,
    pub xTimeOnEntering: TickType_t,
}
#[test]
fn bindgen_test_layout_xTIME_OUT() {
    assert_eq!(
        ::core::mem::size_of::<xTIME_OUT>(),
        8usize,
        concat!("Size of: ", stringify!(xTIME_OUT))
    );
    assert_eq!(
        ::core::mem::align_of::<xTIME_OUT>(),
        4usize,
        concat!("Alignment of ", stringify!(xTIME_OUT))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTIME_OUT>())).xOverflowCount as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xTIME_OUT),
            "::",
            stringify!(xOverflowCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTIME_OUT>())).xTimeOnEntering as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xTIME_OUT),
            "::",
            stringify!(xTimeOnEntering)
        )
    );
}
pub type TimeOut_t = xTIME_OUT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xMEMORY_REGION {
    pub pvBaseAddress: *mut c_types::c_void,
    pub ulLengthInBytes: u32,
    pub ulParameters: u32,
}
#[test]
fn bindgen_test_layout_xMEMORY_REGION() {
    assert_eq!(
        ::core::mem::size_of::<xMEMORY_REGION>(),
        12usize,
        concat!("Size of: ", stringify!(xMEMORY_REGION))
    );
    assert_eq!(
        ::core::mem::align_of::<xMEMORY_REGION>(),
        4usize,
        concat!("Alignment of ", stringify!(xMEMORY_REGION))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMEMORY_REGION>())).pvBaseAddress as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xMEMORY_REGION),
            "::",
            stringify!(pvBaseAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMEMORY_REGION>())).ulLengthInBytes as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xMEMORY_REGION),
            "::",
            stringify!(ulLengthInBytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xMEMORY_REGION>())).ulParameters as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xMEMORY_REGION),
            "::",
            stringify!(ulParameters)
        )
    );
}
pub type MemoryRegion_t = xMEMORY_REGION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTASK_PARAMETERS {
    pub pvTaskCode: TaskFunction_t,
    pub pcName: *const c_types::c_char,
    pub usStackDepth: u16,
    pub pvParameters: *mut c_types::c_void,
    pub uxPriority: UBaseType_t,
    pub puxStackBuffer: *mut StackType_t,
    pub xRegions: [MemoryRegion_t; 1usize],
}
#[test]
fn bindgen_test_layout_xTASK_PARAMETERS() {
    assert_eq!(
        ::core::mem::size_of::<xTASK_PARAMETERS>(),
        36usize,
        concat!("Size of: ", stringify!(xTASK_PARAMETERS))
    );
    assert_eq!(
        ::core::mem::align_of::<xTASK_PARAMETERS>(),
        4usize,
        concat!("Alignment of ", stringify!(xTASK_PARAMETERS))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).pvTaskCode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(pvTaskCode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).pcName as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(pcName)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).usStackDepth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(usStackDepth)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).pvParameters as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(pvParameters)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).uxPriority as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(uxPriority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xTASK_PARAMETERS>())).puxStackBuffer as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(puxStackBuffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_PARAMETERS>())).xRegions as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_PARAMETERS),
            "::",
            stringify!(xRegions)
        )
    );
}
pub type TaskParameters_t = xTASK_PARAMETERS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xTASK_STATUS {
    pub xHandle: TaskHandle_t,
    pub pcTaskName: *const c_types::c_char,
    pub xTaskNumber: UBaseType_t,
    pub eCurrentState: eTaskState,
    pub uxCurrentPriority: UBaseType_t,
    pub uxBasePriority: UBaseType_t,
    pub ulRunTimeCounter: u32,
    pub pxStackBase: *mut StackType_t,
    pub usStackHighWaterMark: u16,
}
#[test]
fn bindgen_test_layout_xTASK_STATUS() {
    assert_eq!(
        ::core::mem::size_of::<xTASK_STATUS>(),
        36usize,
        concat!("Size of: ", stringify!(xTASK_STATUS))
    );
    assert_eq!(
        ::core::mem::align_of::<xTASK_STATUS>(),
        4usize,
        concat!("Alignment of ", stringify!(xTASK_STATUS))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).xHandle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(xHandle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).pcTaskName as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(pcTaskName)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).xTaskNumber as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(xTaskNumber)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).eCurrentState as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(eCurrentState)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).uxCurrentPriority as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(uxCurrentPriority)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).uxBasePriority as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(uxBasePriority)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).ulRunTimeCounter as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(ulRunTimeCounter)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<xTASK_STATUS>())).pxStackBase as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(pxStackBase)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<xTASK_STATUS>())).usStackHighWaterMark as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(xTASK_STATUS),
            "::",
            stringify!(usStackHighWaterMark)
        )
    );
}
pub type TaskStatus_t = xTASK_STATUS;
pub const eSleepModeStatus_eAbortSleep: eSleepModeStatus = 0;
pub const eSleepModeStatus_eStandardSleep: eSleepModeStatus = 1;
pub const eSleepModeStatus_eNoTasksWaitingTimeout: eSleepModeStatus = 2;
pub type eSleepModeStatus = u32;
extern "C" {
    pub fn xTaskCreate(
        pxTaskCode: TaskFunction_t,
        pcName: *const c_types::c_char,
        usStackDepth: u16,
        pvParameters: *mut c_types::c_void,
        uxPriority: UBaseType_t,
        pxCreatedTask: *mut TaskHandle_t,
    ) -> BaseType_t;
}
extern "C" {
    pub fn xTaskCreateStatic(
        pxTaskCode: TaskFunction_t,
        pcName: *const c_types::c_char,
        ulStackDepth: u32,
        pvParameters: *mut c_types::c_void,
        uxPriority: UBaseType_t,
        puxStackBuffer: *mut StackType_t,
        pxTaskBuffer: *mut StaticTask_t,
